Revit 2017 API
ViewPrintingEventArgs Properties
The ViewPrintingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Document
 The document associated with the event.
 (Inherited from RevitAPIPreDocEventArgs.)
Index
 The index of the view being printed out of the set of all views being printed.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
Settings |  Obsolete.
 The print settings of the active printing session.
TotalViews
 The number of all views being printed.
View
 The view to be printed.
See Also
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace